## production: ecs
**✅ &nbsp; Terraform Format:** `success`
**✅ &nbsp; Terraform Plan:** `success`


**⚠️ &nbsp; WARNING:** resources will be destroyed by this change!


```terraform
Plan: 6 to add, 6 to change, 6 to destroy
```


<details>
<summary>Show plan</summary>

```terraform
Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.masked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_appstore_metrics_event_rule-terraform-20210706203355351400000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:4" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_appstore_metrics:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_appstore_metrics" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.masked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_metrics_event_rule-terraform-20210623205803383100000003"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:23" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_metrics:23" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_metrics" -> (known after apply)
      ~ revision                 = 23 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.masked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "masked_server_metrics_event_rule-terraform-20210706203355353300000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:5" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.masked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/masked_server_metrics:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "masked_server_metrics" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_appstore_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_appstore_metrics_event_rule-terraform-20210706203355530800000005"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:4" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_appstore_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_appstore_metrics:4" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/appstore-metrics-etl:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_appstore_metrics" -> (known after apply)
      ~ revision                 = 4 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_metrics.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_metrics_event_rule-terraform-20210623205803384500000004"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:22" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_metrics.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_metrics:22" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  - cpu              = 0 -> null
                  - essential        = true -> null
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                  - mountPoints      = [] -> null
                  ~ portMappings     = [
                      ~ {
                          - hostPort      = 8001 -> null
                          - protocol      = "tcp" -> null
                            # (1 unchanged element hidden)
                        },
                    ]
                  - volumesFrom      = [] -> null
                    # (5 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_metrics" -> (known after apply)
      ~ revision                 = 22 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

  # module.unmasked_server_metrics_etl.aws_cloudwatch_event_target.ecs_scheduled_task will be updated in-place
  ~ resource "aws_cloudwatch_event_target" "ecs_scheduled_task" {
        id             = "unmasked_server_metrics_event_rule-terraform-20210706203355649900000006"
        # (5 unchanged attributes hidden)

      ~ ecs_target {
          ~ task_definition_arn = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:5" -> (known after apply)
            # (3 unchanged attributes hidden)

            # (1 unchanged block hidden)
        }
    }

  # module.unmasked_server_metrics_etl.aws_ecs_task_definition.task_def must be replaced
-/+ resource "aws_ecs_task_definition" "task_def" {
      ~ arn                      = "arn:aws:ecs:ca-central-1:820252213580:task-definition/unmasked_server_metrics:5" -> (known after apply)
      ~ container_definitions    = jsonencode(
          ~ [ # forces replacement
              ~ {
                  ~ image            = "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:4fdbf00b333e54cc06ca89d5c3c0b6862a5e1c40" -> "820252213580.dkr.ecr.ca-central-1.amazonaws.com/covid-server/metrics-server:23d26c3080824c108aee1e83701fc2fc4796cb5e"
                    # (10 unchanged elements hidden)
                } # forces replacement,
            ]
        )
      ~ id                       = "unmasked_server_metrics" -> (known after apply)
      ~ revision                 = 5 -> (known after apply)
        tags                     = {
            "CostCentre" = "CovidShield"
        }
        # (8 unchanged attributes hidden)
    }

Plan: 6 to add, 6 to change, 6 to destroy.

------------------------------------------------------------------------

This plan was saved to: plan.tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "plan.tfplan"


```

</details>